using System.Collections.Generic;

namespace NewYearMovies.Core
{
    public static class DaysMessages
    {
        public static Dictionary<int, string> Messages { get; } = new Dictionary<int, string>()
        {
            { 11, "Начинаем на новогодний марафон фильмов! Приятного просмотра." },
            { 12, "Отличное время начать наряжать ёлку под хорошие новогодние фильмы. До НГ осталось 20 дней..." },
            { 13, "Ух, Понедельник день тяжелый, но с хорошим фильмом после работы, все станет легче." },
            { 17, "С Пятницой! До НГ осталось 15 дней!" },
            { 19, "Воскресенье, идеальное время для просмотра теплых новогодних фильмов :)" },
            { 24, "Сочельник католического Рождества, самое время начинать смотреть фильмы, а у нас их много на эти выходные!" },
            { 25, "С Рождеством! Сегодня праздник фильмов, посмотрим все самое лучшее." },
            { 30, "До НГ осталось всего 2 дня! Начинаем смотреть больше фильмов, больше :))" },
            { 31, "С Наступающим!! Готовим Оливье под самые лучшие фильмы и готовимся.." },
            { 1, "С НОВЫМ ГОДОМ!!! Всего самого лучшего в этом году, пусть сбываются мечты! Давайте доставайте оливье и садимся смотреть Один Дома." },
            { 4, "Ну как вам 2022?) Давайте посмотрим немного фильмов." },
            { 7, "С Рождеством! А у нас сегодня последний день киномарафона, спасибо, что были с нами все это время. Надеюсь вам было тепло и уютно на эти праздники. Увидимся в следующем Декабре!)" }
        };
    }
}